resources/receipt-templates/epson/return-receipt.xml

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><epos-print xmlns="http://www.epson-pos.com/schemas/2011/03/epos-print">
    <feed line="1"/>
    <logo key1="34" key2="48"/>
    <text lang="en"/>
    <text reverse="false" ul="false" em="false" color="color_1"/>
    <text width="1" height="1"/>
    <text reverse="false" ul="false" em="true" color="color_1"/>
    <text>{{store_name}}</text>
    <feed/>
    <text reverse="false" ul="false" em="false" color="color_1"/>
    <text>Org.nr.: {{organization_number}} MVA</text>
    <feed/>
    <text>{{store_address}}</text>
    <feed line="2"/>
    <text reverse="false" ul="false" em="true" color="color_1"/>
    <text>RETURKVITTERING</text>
    <text reverse="false" ul="false" em="false" color="color_1"/>
    <feed line="1"/>
    <text>Kasse-ID: {{session_number}}   Ansatt: {{cashier_name}}</text>
    <feed/>
    <text>Transaksjons-ID: {{transaction_id}}</text>
    <feed/>
    <text>Dato: {{date_time}}</text>
    <feed/>
    {{#original_receipt_number}}
    <text>Original kvittering: {{original_receipt_number}}</text>
    <feed/>
    {{/original_receipt_number}}
    <text>——————————————————————————————————————————</text>
    <feed/>
    <feed/>
    {{#items}}
    <text>{{name}}        {{quantity}} x -{{unit_price}}   -{{line_total}}</text>
    <feed/>
    {{/items}}
    <feed line="2"/>
    <text>——————————————————————————————————————————</text>
    <feed/>
    <text reverse="false" ul="false" em="true" color="color_1"/>
    <text>Total                        -{{total_amount}} {{currency}}</text>
    <feed/>
    <text>——————————————————————————————————————————</text>
    <feed/>
    <text reverse="false" ul="false" em="true" color="color_1"/>
    <text>MVA-sats(Grunnlag)                   MVA</text>
    <text reverse="false" ul="false" em="false" color="color_1"/>
    <feed/>
    <text>{{vat_rate}}%(-{{vat_base}})                       -{{vat_amount}}</text>
    <feed line="2"/>
    <text>Betalingsmiddel: Tilbakeført til {{payment_method_display}}</text>
    {{#terminal_number}}
    <feed/>
    <text>Terminalnr: {{terminal_number}}</text>
    {{/terminal_number}}
    {{#card_brand}}
    <feed/>
    <text>{{card_brand}}</text>
    {{/card_brand}}
    {{#card_last4}}
    <feed/>
    <text>{{card_last4}}</text>
    {{/card_last4}}
    <feed/>
    <text>Returbeløp: {{currency}} -{{total_amount}}</text>
    <feed line="2"/>
    <barcode type="code128" hri="none" font="font_a" width="2" height="40">{{receipt_number}}</barcode>
    <feed/>
    <text>——————————————————————————————————————————</text>
    <text>Takk for besøket, velkommen igjen!</text>
    <feed/>
    <feed/>
    <text font="font_a"/>
    <cut type="feed"/>
</epos-print></s:Body></s:Envelope>

